nine9cats/app/controllers/cats_controller.rb

  def show
    @cat = Cat.find_by(id: (params[:id]))
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "name", "color", "sex", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["birth_date", "2000-12-12"], ["name", "hello"], ["color", "Black"], ["sex", "M"], ["description", "no way"]]

  def edit
    @cat = Cat.find_by(id: (params[:id]))
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    @cat = Cat.find_by(id: (params[:id]))
    # fail
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1 WHERE "cats"."id" = $2  [["description", "patchy skin!"], ["id", 6]]